# Задача 2
# Сделать проверку что вводимая строка является любым host name с окружения (пример amr01-c01-pts01)

hn = input('E.G. amr01-c01-pts01: ').split('-')
print(hn)